davidanson.vscode-markdownlint
github.copilot-chat
github.vscode-pull-request-github
goessner.mdmath
james-yu.latex-workshop
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
openai.chatgpt
reditorsupport.r
reditorsupport.r-syntax
shd101wyy.markdown-preview-enhanced
ultrabytesoftwares.markdown-tree
yzhang.markdown-all-in-one
