alefragnani.project-manager
almenon.arepl
anthropic.claude-code
aprilandjan.ascii-tree-generator
batisteo.vscode-django
bramvanbilsen.matlab-code-run
ccimage.jsonviewer
codezombiech.gitignore
cstrap.python-snippets
davidanson.vscode-markdownlint
deerawan.vscode-dash
demystifying-javascript.python-extensions-pack
docker.docker
donjayamanne.git-extension-pack
donjayamanne.githistory
doonfrs.wsl-reveal-explorer
eamodio.gitlens
franneck94.c-cpp-runner
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
goessner.mdmath
google.colab
google.geminicodeassist
hbenl.vscode-test-explorer
james-yu.latex-workshop
jeff-hykin.better-cpp-syntax
kaih2o.python-resource-monitor
kevinrose.vsc-python-indent
leanprover.lean4
littlefoxteam.vscode-python-test-adapter
mathematic.vscode-latex
mathworks.language-matlab
mechatroner.rainbow-csv
mintlify.document
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vscode.vscode-speech
njpwerner.autodocstring
njqdev.vscode-python-typehint
nothlng.vscode-open-wsl
nvidia.nsight-vscode-edition
oderwat.indent-rainbow
oijaz.unicode-latex
openai.chatgpt
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
robclouth.wsl-path-tools
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
sourcery.sourcery
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
thebarkman.vscode-djaneiro
tomoki1207.pdf
trabpukcip.wolf
twxs.cmake
ultrabytesoftwares.markdown-tree
vadimcn.vscode-lldb
xirider.livecode
yzhang.markdown-all-in-one
zainchen.json
ziyasal.vscode-open-in-github
